# Ramki danych (DataFrames)

DataFrame to koń pociągowy biblioteki pandas, bezpośrednio zainspirowany językiem R. Możemy myśleć o DataFrame jak o zbiorze obiektów Series połączonych tak, aby współdzieliły ten sam indeks. Użyjmy pandas, aby zgłębić ten temat!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [5]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

## Wybór i indeksowanie

Poznajmy różne metody pobierania danych z DataFrame

In [5]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [6]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
df[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [6]:
# Przekazanie listy nazw kolumn
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [7]:
# Składnia podobna do SQL (NIEZALECANA!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

Kolumny DataFrame to po prostu Series

In [8]:
type(df['W'])

pandas.core.series.Series

### Tworzenie nowej kolumny:

In [8]:
df['new'] = df['W'] + df['Y']

In [9]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [10]:
df["pusta"] = np.nan

In [13]:
df["new"] + df["pusta"].fillna(0)

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
dtype: float64

### Usuwanie kolumn

In [16]:
df.drop('new',axis=1)

          W         X         Y         Z  pusta
A  2.706850  0.628133  0.907969  0.503826    NaN
B  0.651118 -0.319318 -0.848077  0.605965    NaN
C -2.018168  0.740122  0.528813 -0.589001    NaN
D  0.188695 -0.758872 -0.933237  0.955057    NaN
E  0.190794  1.978757  2.605967  0.683509    NaN

In [17]:
# Nie działa in-place, chyba że podano inaczej!
df

          W         X         Y         Z       new  pusta
A  2.706850  0.628133  0.907969  0.503826  3.614819    NaN
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959    NaN
C -2.018168  0.740122  0.528813 -0.589001 -1.489355    NaN
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542    NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762    NaN

In [18]:
df.drop('new',axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z  pusta
A  2.706850  0.628133  0.907969  0.503826    NaN
B  0.651118 -0.319318 -0.848077  0.605965    NaN
C -2.018168  0.740122  0.528813 -0.589001    NaN
D  0.188695 -0.758872 -0.933237  0.955057    NaN
E  0.190794  1.978757  2.605967  0.683509    NaN

W ten sposób można też usuwać wiersze:

In [20]:
df.drop('E',axis=0)

          W         X         Y         Z  pusta
A  2.706850  0.628133  0.907969  0.503826    NaN
B  0.651118 -0.319318 -0.848077  0.605965    NaN
C -2.018168  0.740122  0.528813 -0.589001    NaN
D  0.188695 -0.758872 -0.933237  0.955057    NaN

### Wybieranie wierszy

In [21]:
df.loc['A']

W        2.706850
X        0.628133
Y        0.907969
Z        0.503826
pusta         NaN
Name: A, dtype: float64

In [22]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

Lub wybierz na podstawie pozycji zamiast etykiety

In [23]:
df.iloc[2]

W       -2.018168
X        0.740122
Y        0.528813
Z       -0.589001
pusta         NaN
Name: C, dtype: float64

### Wybieranie podzbioru wierszy i kolumn

In [24]:
df.loc['B','Y']

np.float64(-0.8480769834036315)

In [27]:
df.iloc[1,2]

np.float64(-0.8480769834036315)

In [25]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [29]:
df.loc["A":"C", "X":"Y"]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813

### Wybór warunkowy

Ważną funkcją pandas jest wybór warunkowy z użyciem nawiasów, bardzo podobny do numpy:

In [30]:
df

          W         X         Y         Z  pusta
A  2.706850  0.628133  0.907969  0.503826    NaN
B  0.651118 -0.319318 -0.848077  0.605965    NaN
C -2.018168  0.740122  0.528813 -0.589001    NaN
D  0.188695 -0.758872 -0.933237  0.955057    NaN
E  0.190794  1.978757  2.605967  0.683509    NaN

In [31]:
df>0

       W      X      Y      Z  pusta
A   True   True   True   True  False
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True  False

In [32]:
float("nan") > 0

False

In [33]:
df[df>0]

          W         X         Y         Z  pusta
A  2.706850  0.628133  0.907969  0.503826    NaN
B  0.651118       NaN       NaN  0.605965    NaN
C       NaN  0.740122  0.528813       NaN    NaN
D  0.188695       NaN       NaN  0.955057    NaN
E  0.190794  1.978757  2.605967  0.683509    NaN

In [34]:
df[df['W']>0]

          W         X         Y         Z  pusta
A  2.706850  0.628133  0.907969  0.503826    NaN
B  0.651118 -0.319318 -0.848077  0.605965    NaN
D  0.188695 -0.758872 -0.933237  0.955057    NaN
E  0.190794  1.978757  2.605967  0.683509    NaN

In [24]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [25]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

Dla dwóch warunków możesz użyć | oraz & wraz z nawiasami:

In [26]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

## Więcej o indeksach

Omówmy dodatkowe funkcje indeksowania, w tym resetowanie indeksu lub ustawianie innej kolumny jako indeksu. Wspomnimy też o hierarchii indeksów!

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# Reset do domyślnego indeksu 0,1...n
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [29]:
newind = 'CA NY WY OR CO'.split()

In [30]:
df['States'] = newind

In [31]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [32]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [33]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [34]:
df.set_index('States',inplace=True)

In [35]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Podsumowania DataFrame
Istnieje kilka sposobów uzyskania podsumowań DataFrame.<br>
<tt><strong>df.describe()</strong></tt> zwraca statystyki opisowe wszystkich kolumn liczbowych.<br>
<tt><strong>df.info i df.dtypes</strong></tt> wyświetlają typ danych wszystkich kolumn.

In [35]:
df.describe()

              W         X         Y         Z  pusta
count  5.000000  5.000000  5.000000  5.000000    0.0
mean   0.343858  0.453764  0.452287  0.431871    NaN
std    1.681131  1.061385  1.454516  0.594708    NaN
min   -2.018168 -0.758872 -0.933237 -0.589001    NaN
25%    0.188695 -0.319318 -0.848077  0.503826    NaN
50%    0.190794  0.628133  0.528813  0.605965    NaN
75%    0.651118  0.740122  0.907969  0.683509    NaN
max    2.706850  1.978757  2.605967  0.955057    NaN

In [36]:
df.describe?

Signature: df.describe(percentiles=None, include=None, exclude=None) -> 'Self'
Docstring:
Generate descriptive statistics.

Descriptive statistics include those that summarize the central
tendency, dispersion and shape of a
dataset's distribution, excluding ``NaN`` values.

Analyzes both numeric and object series, as well
as ``DataFrame`` column sets of mixed data types. The output
will vary depending on what is provided. Refer to the notes
below for more detail.

Parameters
----------
percentiles : list-like of numbers, optional
    The percentiles to include in the output. All should
    fall between 0 and 1. The default is
    ``[.25, .5, .75]``, which returns the 25th, 50th, and
    75th percentiles.
include : 'all', list-like of dtypes or None (default), optional
    A white list of data types to include in the result. Ignored
    for ``Series``. Here are the options:

    - 'all' : All columns of the input will be included in the output.
    - A list-like of dtypes : Limits the results to the
      provided data types.
      To limit the result to numeric types submit
      ``numpy.number``. To limit it instead to object columns submit
      the ``numpy.object`` data type. Strings
      can also be used in the style of
      ``select_dtypes`` (e.g. ``df.describe(include=['O'])``). To
      select pandas categorical columns, use ``'category'``
    - None (default) : The result will include all numeric columns.
exclude : list-like of dtypes or None (default), optional,
    A black list of data types to omit from the result. Ignored
    for ``Series``. Here are the options:

    - A list-like of dtypes : Excludes the provided data types
      from the result. To exclude numeric types submit
      ``numpy.number``. To exclude object columns submit the data
      type ``numpy.object``. Strings can also be used in the style of
      ``select_dtypes`` (e.g. ``df.describe(exclude=['O'])``). To
      exclude pandas categorical columns, use ``'category'``
    - None (default) : The result will exclude nothing.

Returns
-------
Series or DataFrame
    Summary statistics of the Series or Dataframe provided.

See Also
--------
DataFrame.count: Count number of non-NA/null observations.
DataFrame.max: Maximum of the values in the object.
DataFrame.min: Minimum of the values in the object.
DataFrame.mean: Mean of the values.
DataFrame.std: Standard deviation of the observations.
DataFrame.select_dtypes: Subset of a DataFrame including/excluding
    columns based on their dtype.

Notes
-----
For numeric data, the result's index will include ``count``,
``mean``, ``std``, ``min``, ``max`` as well as lower, ``50`` and
upper percentiles. By default the lower percentile is ``25`` and the
upper percentile is ``75``. The ``50`` percentile is the
same as the median.

For object data (e.g. strings or timestamps), the result's index
will include ``count``, ``unique``, ``top``, and ``freq``. The ``top``
is the most common value. The ``freq`` is the most common value's
frequency. Timestamps also include the ``first`` and ``last`` items.

If multiple object values have the highest count, then the
``count`` and ``top`` results will be arbitrarily chosen from
among those with the highest count.

For mixed data types provided via a ``DataFrame``, the default is to
return only an analysis of numeric columns. If the dataframe consists
only of object and categorical data without any numeric columns, the
default is to return an analysis of both the object and categorical
columns. If ``include='all'`` is provided as an option, the result
will include a union of attributes of each type.

The `include` and `exclude` parameters can be used to limit
which columns in a ``DataFrame`` are analyzed for the output.
The parameters are ignored when analyzing a ``Series``.

Examples
--------
Describing a numeric ``Series``.

>>> s = pd.Series([1, 2, 3])
>>> s.describe()
count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

Describing a categorical ``Series``.

>>> s = pd.Series(['a', 'a', 'b', 'c'])
>>> s.describe()
count     4
unique    3
top       a
freq      2
dtype: object

Describing a timestamp ``Series``.

>>> s = pd.Series([
...     np.datetime64("2000-01-01"),
...     np.datetime64("2010-01-01"),
...     np.datetime64("2010-01-01")
... ])
>>> s.describe()
count                      3
mean     2006-09-01 08:00:00
min      2000-01-01 00:00:00
25%      2004-12-31 12:00:00
50%      2010-01-01 00:00:00
75%      2010-01-01 00:00:00
max      2010-01-01 00:00:00
dtype: object

Describing a ``DataFrame``. By default only numeric fields
are returned.

>>> df = pd.DataFrame({'categorical': pd.Categorical(['d', 'e', 'f']),
...                    'numeric': [1, 2, 3],
...                    'object': ['a', 'b', 'c']
...                    })
>>> df.describe()
       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

Describing all columns of a ``DataFrame`` regardless of data type.

>>> df.describe(include='all')  # doctest: +SKIP
       categorical  numeric object
count            3      3.0      3
unique           3      NaN      3
top              f      NaN      a
freq             1      NaN      1
mean           NaN      2.0    NaN
std            NaN      1.0    NaN
min            NaN      1.0    NaN
25%            NaN      1.5    NaN
50%            NaN      2.0    NaN
75%            NaN      2.5    NaN
max            NaN      3.0    NaN

Describing a column from a ``DataFrame`` by accessing it as
an attribute.

>>> df.numeric.describe()
count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
Name: numeric, dtype: float64

Including only numeric columns in a ``DataFrame`` description.

>>> df.describe(include=[np.number])
       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

Including only string columns in a ``DataFrame`` description.

>>> df.describe(include=[object])  # doctest: +SKIP
       object
count       3
unique      3
top         a
freq        1

Including only categorical columns from a ``DataFrame`` description.

>>> df.describe(include=['category'])
       categorical
count            3
unique           3
top              d
freq             1

Excluding numeric columns from a ``DataFrame`` description.

>>> df.describe(exclude=[np.number])  # doctest: +SKIP
       categorical object
count            3      3
unique           3      3
top              f      a
freq             1      1

Excluding object columns from a ``DataFrame`` description.

>>> df.describe(exclude=[object])  # doctest: +SKIP
       categorical  numeric
count            3      3.0
unique           3      NaN
top              f      NaN
freq             1      NaN
mean           NaN      2.0
std            NaN      1.0
min            NaN      1.0
25%            NaN      1.5
50%            NaN      2.0
75%            NaN      2.5
max            NaN      3.0
File:      ~/workspace/szkolenia/DL_22_11_2025/.venv/lib/python3.11/site-packages/pandas/core/generic.py
Type:      method

In [37]:
df.dtypes

W        float64
X        float64
Y        float64
Z        float64
pusta    float64
dtype: object

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [38]:
df["XX"] = df["W"] > 0

In [39]:
df

          W         X         Y         Z  pusta     XX
A  2.706850  0.628133  0.907969  0.503826    NaN   True
B  0.651118 -0.319318 -0.848077  0.605965    NaN   True
C -2.018168  0.740122  0.528813 -0.589001    NaN  False
D  0.188695 -0.758872 -0.933237  0.955057    NaN   True
E  0.190794  1.978757  2.605967  0.683509    NaN   True

In [41]:
df.dtypes

W        float64
X        float64
Y        float64
Z        float64
pusta    float64
XX          bool
dtype: object

In [42]:
df.XX.astype("category")

A     True
B     True
C    False
D     True
E     True
Name: XX, dtype: category
Categories (2, bool): [False, True]

In [46]:
df.loc["E", "Z"] = 1.23

In [47]:
df

          W         X         Y         Z  pusta     XX
A  2.706850  0.628133  0.907969  0.503826    NaN   True
B  0.651118 -0.319318 -0.848077  0.605965    NaN   True
C -2.018168  0.740122  0.528813 -0.589001    NaN  False
D  0.188695 -0.758872 -0.933237  0.955057    NaN   True
E  0.190794  1.978757  2.605967  1.230000    NaN   True